#+TITLE: Tema 4: Tipos avanzados de datos
#+DATE:
#+STARTUP: beamer
#+SETUPFILE: config.org
#+PROPERTY: header-args :tangle code/04-datosAvanzados.c :comments org
#+OPTIONS: H:2

** Elementos de un vector
 - Se referencian con el nombre del vector seguido de un subíndice entre corchetes.
 - El subíndice representa la posición del elemento dentro del vector.
 - La *primera posición* del vector tiene el *subíndice 0*.

#+begin_src C
#include <stdio.h>

int main()
{
  int miVector[3];
  miVector[0] = 10;
  miVector[1] = 2 * miVector[0];
  miVector[2] = miVector[0] + miVector[1];

  printf("Posicion 0 = %d\n", miVector[0]);
  printf("Posicion 1 = %d\n", miVector[1]);
  printf("Posicion 2 = %d\n", miVector[2]);
}

 #+end_src

 #+RESULTS:
 | Posicion | 0 | = | 10 |
 | Posicion | 1 | = | 20 |
 | Posicion | 2 | = | 30 |

** Acceso a datos de un vectores
#+BEGIN_SRC C
#include <stdio.h>

int main()
{
  float temp[5] = {2.1, 4.9, 0.51, 4.3, 9.01};
  int i;
  // Es común el uso de bucles for para
  // recorrer un vector. Es importante
  // recordar que el primer elemento 
  // tiene índice 0.
  for (i = 0; i < 5; i++)
    printf("El elemento %d es %f\n",
	   i + 1, temp[i]);
  return 0;
}
#+END_SRC


#+RESULTS:
| El | elemento | 0 | es |  2.1 |
| El | elemento | 1 | es |  4.9 |
| El | elemento | 2 | es | 0.51 |
| El | elemento | 3 | es |  4.3 |
| El | elemento | 4 | es | 9.01 |

*** Suma de dos vectores

#+BEGIN_SRC C
#include <stdio.h>
int main()
{
  float v1[5] = {1, 34, 32, 45, 34};
  float v2[5] = {12, -3, 34, 15, -5};
  float v3[5];
  int i;
  
  for(i = 0; i < 5; i++)
      v3[i] = v1[i] + v2[i];

  printf("Vector3: ");
  for(i = 0; i < 5; i++)
    printf("%f ", v3[i]);
  printf("\n");
  return 0;
}
#+END_SRC

#+RESULTS:
: Vector3: 13.000000 31.000000 66.000000 60.000000 29.000000

*** Multiplicar un vector por una constante
#+BEGIN_SRC C
#include <stdio.h> 
int main()
{
  float v1[5] = {1, 34, 32, 45, 34};
  float v2[5];
  float K = 3.0;
  int i;
  
  for(i = 0; i < 5; i++)
      v2[i] = K * v1[i];

  for(i = 0; i < 5; i++)
    printf("V1: %f\t V2: %f\n",
	   v1[i], v2[i]);

  return 0;
}
#+END_SRC

#+RESULTS:
| V1: 1.000000  | V2: 3.000000   |
| V1: 34.000000 | V2: 102.000000 |
| V1: 32.000000 | V2: 96.000000  |
| V1: 45.000000 | V2: 135.000000 |
| V1: 34.000000 | V2: 102.000000 |


** Elementos de una cadena
 - Se referencian con el nombre seguido de un subíndice entre corchetes.
 - El subíndice representa la posición del elemento dentro de la cadena.
 - La *primera posición* tiene el *subíndice 0*.
 - La *última posición* es el carácter nulo =\0=.

#+begin_src C
#include <stdio.h>

int main()
{
  char cadena[5] = "Hola";
  printf("%c \t %c \t %c \t %c \n",
	 cadena[0], cadena[1],
	 cadena[2], cadena[3],
	 cadena[4]);
  return 0;
}
#+end_src

#+RESULTS:
| La  | cadena     | es   | Hola. |
| Los | caracteres | son: |       |
| H   | o          | l    | a     |

** Recorrido por los elementos
- El bucle =while= es el más indicado, usando el carácter nulo para terminar:

#+begin_src C
#include <stdio.h>

int main()
{
  char cadena[5] = "Hola";
  int i = 0;
  printf("Los caracteres son:\n");
  while (cadena[i] != '\0')
    {
      printf("%c \t", cadena[i]);
      i++;
    }
  return 0;
}
#+end_src

#+RESULTS:
| La  | cadena     | es   | Hola. |
| Los | caracteres | son: |       |
| H   | o          | l    | a     |

** Recorrido por los elementos
- También se puede usar un bucle =for= (equivalencia entre =for= y =while=)

#+begin_src C
#include <stdio.h>

int main()
{
  char cadena[5] = "Hola";
  int i = 0;
  printf("Los caracteres son:\n");
  for(i = 0; cadena[i] != '\0'; i++)
    {
      printf("%c \t", cadena[i]);
    }
  return 0;
}
#+end_src

#+RESULTS:
| La  | cadena     | es   | Hola. |
| Los | caracteres | son: |       |
| H   | o          | l    | a     |


** Copiar cadenas :: =strcpy=

Con =strcpy= tenemos una solución óptima para la asignación de contenido.

#+BEGIN_SRC C
#include <stdio.h>
#include <string.h>
int main()
{
  char s1[50], s2[50];
  strcpy(s1, "Hello World!");
  strcpy(s2, s1);
  printf("%s\n", s2);
  return 0;
}
#+END_SRC

#+RESULTS:
: Hello World!

** Concatenar cadenas :: =strcat=

#+BEGIN_SRC C
#include <stdio.h>
#include <string.h>

int main()
{
  char nombre_completo[50];
  char nombre[ ] = "Juana";
  char apellido[ ] = "de Arco";
  // Copiamos por tramos:
  // Primero el nombre
  strcpy(nombre_completo, nombre);
  // A continuacion un espacio
  strcat(nombre_completo, " ");
  // Finalmente el apellido
  strcat(nombre_completo, apellido);
  printf("El nombre completo es: %s.\n",
	 nombre_completo);
  return 0;
}
#+END_SRC

#+RESULTS:
: El nombre completo es: Juana de Arco.

** Inicialización de una matriz
- Los elementos de una matriz pueden iniciarse en el momento de la declaración.
#+BEGIN_SRC C
#include <stdio.h>
int main()
{
  // Matriz de dos filas, tres columnas
  int matriz[2][3] = {10, 20, 30, 40, 50, 60};
  int fil, col;
  // Recorremos con bucle anidado
  for(fil = 0; fil < 2; fil++)
    {
      for(col = 0; col < 3; col++)
	printf("%d\t",matriz[fil][col]);
      printf("\n\n");
    }
return 0;
}
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |
|   |   |   |
| 4 | 5 | 6 |


** Ejemplo (1)
#+BEGIN_SRC C
#include <stdio.h>
enum dia{ //valores enteros: 0 al 6
  lunes, martes, miercoles, jueves, viernes, sabado, domingo
};

int main()
{
  enum dia hoy, manana;
  hoy = lunes;
  manana = hoy + 1;
  printf("%d\n", hoy);
  printf("%d\n", manana);
  return 0;
}
#+END_SRC

#+RESULTS:
| 0 |
| 1 |

** Ejemplo (2)
#+BEGIN_SRC C
#include <stdio.h>
enum dia{ //valores enteros: 1 en adelante
  lunes = 1, martes, miercoles, jueves, viernes, sabado, domingo
};

int main()
{
  enum dia hoy, manana;
  hoy = lunes;
  manana = hoy + 1;
  printf("%d\n", hoy);
  printf("%d\n", manana);
  return 0;
}
#+END_SRC

#+RESULTS:
| 1 |
| 2 |


# Local Variables:
# ispell-local-dictionary: "spanish"
# End:
